<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b663860cdb7cd8e8ab852164df0202d34fd0ae8310c4d1b3504293a15ac2977d","plan_job_ref":"Job Plan Airflow DAGs #39 at https://github.com/cal-itp/data-infra/actions/runs/14977467122","plan_out_hash":"489ac864a247e45a595afe200a871f461b3b917f8460f722af006f840a686020","plan_hash":"c1d3f3a72b0ecca42e9465058b6eab26f8c5f4ee123d44b5677108e16f823378","plan_text_format":"diff-trunc","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 432 to add, 92 to change, 420 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/METADATA.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "xFF5DQ==" -> (known after apply)
!~      detect_md5hash      = "7ND0pG9AgeKQKXdsqPdE8A==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473201786382 -> (known after apply)
!~      id                  = "************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "7ND0pG9AgeKQKXdsqPdE8A==" -> (known after apply)
!~      md5hexhash          = "ecd0f4a46f4081e29029776ca8f744f0" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2FMETADATA.yml?generation=1746473201786382&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/METADATA.yml"
!~      output_name         = "dags/airtable_loader_v2/METADATA.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2FMETADATA.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/README.md"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "/yzaRQ==" -> (known after apply)
!~      detect_md5hash      = "lXaZ5QsghNrges+XFak4Aw==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473193705926 -> (known after apply)
!~      id                  = "*********************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "lXaZ5QsghNrges+XFak4Aw==" -> (known after apply)
!~      md5hexhash          = "957699e50b2084dae07acf9715a93803" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2FREADME.md?generation=1746473193705926&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/README.md"
!~      output_name         = "dags/airtable_loader_v2/README.md" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2FREADME.md" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_county_geography.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "ghHGOA==" -> (known after apply)
!~      detect_md5hash      = "LOx1uqCGq1ceLjmvY8XYUA==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473203651241 -> (known after apply)
!~      id                  = "***************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "LOx1uqCGq1ceLjmvY8XYUA==" -> (known after apply)
!~      md5hexhash          = "2cec75baa086ab571e2e39af63c5d850" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_county_geography.yml?generation=1746473203651241&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_county_geography.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_county_geography.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_county_geography.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_eligibility_programs.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "+4ZyVQ==" -> (known after apply)
!~      detect_md5hash      = "VEDkxNUDqpL0HG6mOyC/Qw==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473196903779 -> (known after apply)
!~      id                  = "*******************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "VEDkxNUDqpL0HG6mOyC/Qw==" -> (known after apply)
!~      md5hexhash          = "5440e4c4d503aa92f41c6ea63b20bf43" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_eligibility_programs.yml?generation=1746473196903779&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_eligibility_programs.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_eligibility_programs.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_eligibility_programs.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_fare_systems.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "V39wRQ==" -> (known after apply)
!~      detect_md5hash      = "6wF51vHBjy+57mVpoPueVQ==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473205416035 -> (known after apply)
!~      id                  = "***********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "6wF51vHBjy+57mVpoPueVQ==" -> (known after apply)
!~      md5hexhash          = "eb0179d6f1c18f2fb9ee6569a0fb9e55" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_fare_systems.yml?generation=1746473205416035&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_fare_systems.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_fare_systems.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_fare_systems.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_funding_programs.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "C+kUhA==" -> (known after apply)
!~      detect_md5hash      = "iidqHJORfoOK0NIZwesC6A==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473198344538 -> (known after apply)
!~      id                  = "***************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "iidqHJORfoOK0NIZwesC6A==" -> (known after apply)
!~      md5hexhash          = "8a276a1c93917e838ad0d219c1eb02e8" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_funding_programs.yml?generation=1746473198344538&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_funding_programs.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_funding_programs.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_funding_programs.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_gtfs_datasets.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "cTZbyg==" -> (known after apply)
!~      detect_md5hash      = "YOUbhnTuYUnqnhti3/wlsA==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473229063545 -> (known after apply)
!~      id                  = "************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "YOUbhnTuYUnqnhti3/wlsA==" -> (known after apply)
!~      md5hexhash          = "60e51b8674ee6149ea9e1b62dffc25b0" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_gtfs_datasets.yml?generation=1746473229063545&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_gtfs_datasets.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_gtfs_datasets.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_gtfs_datasets.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_gtfs_service_data.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "ysjhcw==" -> (known after apply)
!~      detect_md5hash      = "jqA07hZDzMGJqqKogpCQKw==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473209669663 -> (known after apply)
!~      id                  = "****************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "jqA07hZDzMGJqqKogpCQKw==" -> (known after apply)
!~      md5hexhash          = "8ea034ee1643ccc189aaa2a88290902b" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_gtfs_service_data.yml?generation=1746473209669663&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_gtfs_service_data.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_gtfs_service_data.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_gtfs_service_data.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_modes.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "8opeXA==" -> (known after apply)
!~      detect_md5hash      = "R8xo/NnrVYlRHWFL4mzcMw==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473209198345 -> (known after apply)
!~      id                  = "****************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "R8xo/NnrVYlRHWFL4mzcMw==" -> (known after apply)
!~      md5hexhash          = "47cc68fcd9eb5589511d614be26cdc33" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_modes.yml?generation=1746473209198345&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_modes.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_modes.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_modes.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_ntd_agency_info.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "A5XB+g==" -> (known after apply)
!~      detect_md5hash      = "ov1oqrB2BUp2IVcAUT7YDA==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473197819308 -> (known after apply)
!~      id                  = "**************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "ov1oqrB2BUp2IVcAUT7YDA==" -> (known after apply)
!~      md5hexhash          = "a2fd68aab076054a76215700513ed80c" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_ntd_agency_info.yml?generation=1746473197819308&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_ntd_agency_info.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_ntd_agency_info.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_ntd_agency_info.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_organizations.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "qRKxxg==" -> (known after apply)
!~      detect_md5hash      = "01Ctk27109nG5JiZKFfJ6A==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473200170416 -> (known after apply)
!~      id                  = "************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "01Ctk27109nG5JiZKFfJ6A==" -> (known after apply)
!~      md5hexhash          = "d350ad936ef5d3d9c6e498992857c9e8" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_organizations.yml?generation=1746473200170416&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_organizations.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_organizations.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_organizations.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_place_geography.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "JnLM/g==" -> (known after apply)
!~      detect_md5hash      = "++bVTNxCS/Wr6uY3nmV0/A==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473194538765 -> (known after apply)
!~      id                  = "**************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "++bVTNxCS/Wr6uY3nmV0/A==" -> (known after apply)
!~      md5hexhash          = "fbe6d54cdc424bf5abeae6379e6574fc" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_place_geography.yml?generation=1746473194538765&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_place_geography.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_place_geography.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_place_geography.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_rider_requirements.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "Di3Y7g==" -> (known after apply)
!~      detect_md5hash      = "XXVgPJ+YN6KSzzNLoVflUA==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473199223294 -> (known after apply)
!~      id                  = "*****************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "XXVgPJ+YN6KSzzNLoVflUA==" -> (known after apply)
!~      md5hexhash          = "5d75603c9f9837a292cf334ba157e550" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_rider_requirements.yml?generation=1746473199223294&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_rider_requirements.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_rider_requirements.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_rider_requirements.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/california_transit_services.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "3IR4Ww==" -> (known after apply)
!~      detect_md5hash      = "q7km+toulh1ktg9k7ZBPbw==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473207333308 -> (known after apply)
!~      id                  = "*******************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "q7km+toulh1ktg9k7ZBPbw==" -> (known after apply)
!~      md5hexhash          = "abb926fada2e961d64b60f64ed904f6f" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_services.yml?generation=1746473207333308&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/california_transit_services.yml"
!~      output_name         = "dags/airtable_loader_v2/california_transit_services.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fcalifornia_transit_services.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/generate_gtfs_download_configs.py"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "LLSRKg==" -> (known after apply)
!~      detect_md5hash      = "WEFwfVbJm4J6LdTF0abD2A==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473194787917 -> (known after apply)
!~      id                  = "*********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "WEFwfVbJm4J6LdTF0abD2A==" -> (known after apply)
!~      md5hexhash          = "5841707d56c99b827a2dd4c5d1a6c3d8" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fgenerate_gtfs_download_configs.py?generation=1746473194787917&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/generate_gtfs_download_configs.py"
!~      output_name         = "dags/airtable_loader_v2/generate_gtfs_download_configs.py" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Fgenerate_gtfs_download_configs.py" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_data_quality_issues_gtfs_datasets.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "HRSRdg==" -> (known after apply)
!~      detect_md5hash      = "urMhnWtTGr/CdMgukT+lXQ==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473208760588 -> (known after apply)
!~      id                  = "*********************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "urMhnWtTGr/CdMgukT+lXQ==" -> (known after apply)
!~      md5hexhash          = "bab3219d6b531abfc274c82e913fa55d" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_data_quality_issues_gtfs_datasets.yml?generation=1746473208760588&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_data_quality_issues_gtfs_datasets.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_data_quality_issues_gtfs_datasets.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_data_quality_issues_gtfs_datasets.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_data_quality_issues_issue_types.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "lUZB6Q==" -> (known after apply)
!~      detect_md5hash      = "o/0UMHfUWPgjS3Yyi7vfRg==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473209221438 -> (known after apply)
!~      id                  = "*******************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "o/0UMHfUWPgjS3Yyi7vfRg==" -> (known after apply)
!~      md5hexhash          = "a3fd143077d458f8234b76328bbbdf46" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_data_quality_issues_issue_types.yml?generation=1746473209221438&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_data_quality_issues_issue_types.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_data_quality_issues_issue_types.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_data_quality_issues_issue_types.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_data_quality_issues_services.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "FmhQ/Q==" -> (known after apply)
!~      detect_md5hash      = "Cfcmokaz+RJhKAIbw/3JNA==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473197358658 -> (known after apply)
!~      id                  = "****************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "Cfcmokaz+RJhKAIbw/3JNA==" -> (known after apply)
!~      md5hexhash          = "09f726a246b3f9126128021bc3fdc934" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_data_quality_issues_services.yml?generation=1746473197358658&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_data_quality_issues_services.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_data_quality_issues_services.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_data_quality_issues_services.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_data_quality_issues_transit_data_quality_issues.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "n1/3uA==" -> (known after apply)
!~      detect_md5hash      = "IhypD6MITmx/MEivxx9g1A==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473203492501 -> (known after apply)
!~      id                  = "***********************************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "IhypD6MITmx/MEivxx9g1A==" -> (known after apply)
!~      md5hexhash          = "221ca90fa3084e6c7f3048afc71f60d4" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_data_quality_issues_transit_data_quality_issues.yml?generation=1746473203492501&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_data_quality_issues_transit_data_quality_issues.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_data_quality_issues_transit_data_quality_issues.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_data_quality_issues_transit_data_quality_issues.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_components.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "KbWF7g==" -> (known after apply)
!~      detect_md5hash      = "M3uOGWC5F5Bdc/LUaqgKAw==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473198820610 -> (known after apply)
!~      id                  = "**********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "M3uOGWC5F5Bdc/LUaqgKAw==" -> (known after apply)
!~      md5hexhash          = "337b8e1960b917905d73f2d46aa80a03" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_components.yml?generation=1746473198820610&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_tech_stacks_components.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_tech_stacks_components.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_components.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_contracts.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "xVglGg==" -> (known after apply)
!~      detect_md5hash      = "Zib7+/NQ4h5viRtHRuZsAg==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473201124688 -> (known after apply)
!~      id                  = "*********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "Zib7+/NQ4h5viRtHRuZsAg==" -> (known after apply)
!~      md5hexhash          = "6626fbfbf350e21e6f891b4746e66c02" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_contracts.yml?generation=1746473201124688&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_tech_stacks_contracts.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_tech_stacks_contracts.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_contracts.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_data_schemas.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "WEso2A==" -> (known after apply)
!~      detect_md5hash      = "w3ys7ni7cE104AxYZ0R6+w==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473203980659 -> (known after apply)
!~      id                  = "************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "w3ys7ni7cE104AxYZ0R6+w==" -> (known after apply)
!~      md5hexhash          = "c37cacee78bb704d74e00c5867447afb" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_data_schemas.yml?generation=1746473203980659&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_tech_stacks_data_schemas.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_tech_stacks_data_schemas.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_data_schemas.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_organizations.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "r9HYuQ==" -> (known after apply)
!~      detect_md5hash      = "mdeQFQ85qw4IC7mB2N/K7g==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473227493115 -> (known after apply)
!~      id                  = "*************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "mdeQFQ85qw4IC7mB2N/K7g==" -> (known after apply)
!~      md5hexhash          = "99d790150f39ab0e080bb981d8dfcaee" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_organizations.yml?generation=1746473227493115&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_tech_stacks_organizations.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_tech_stacks_organizations.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_organizations.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_products.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "nnTO8A==" -> (known after apply)
!~      detect_md5hash      = "Q2fhTd7M7RskHlOTjYumcw==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473231192737 -> (known after apply)
!~      id                  = "********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "Q2fhTd7M7RskHlOTjYumcw==" -> (known after apply)
!~      md5hexhash          = "4367e14ddecced1b241e53938d8ba673" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_products.yml?generation=1746473231192737&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_tech_stacks_products.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_tech_stacks_products.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_products.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_properties_features.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "TaRU9Q==" -> (known after apply)
!~      detect_md5hash      = "syHApJvv+ta00W/9RBLb8A==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473204457653 -> (known after apply)
!~      id                  = "*******************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "syHApJvv+ta00W/9RBLb8A==" -> (known after apply)
!~      md5hexhash          = "b321c0a49beffad6b4d16ffd4412dbf0" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_properties_features.yml?generation=1746473204457653&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_tech_stacks_properties_features.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_tech_stacks_properties_features.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_properties_features.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_relationships_service_components.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "9a35QA==" -> (known after apply)
!~      detect_md5hash      = "h49AK4u81yW1ojLEd2Gu1A==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473201616091 -> (known after apply)
!~      id                  = "********************************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "h49AK4u81yW1ojLEd2Gu1A==" -> (known after apply)
!~      md5hexhash          = "878f402b8bbcd725b5a232c47761aed4" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_relationships_service_components.yml?generation=1746473201616091&alt=media" -> (known after apply)
-       metadata            = { # forces replacement
-           "goog-reserved-file-mtime" = "1747067124"
        } -> null
        name                = "dags/airtable_loader_v2/transit_tech_stacks_relationships_service_components.yml"
!~      output_name         = "dags/airtable_loader_v2/transit_tech_stacks_relationships_service_components.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fairtable_loader_v2%2Ftransit_tech_stacks_relationships_service_components.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/airtable_loader_v2/transit_tech_stacks_service_components.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
+       content             = (sensitive value)
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "0rCcZg==" -> (known after apply)
!~      detect_md5hash      = "3iyl74cZVjsjxwSsMVBOiQ==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1746473205934157 -> (known after apply)
!~      id                  = "******************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "3iyl74cZVjsjxwSsMVBOiQ==" -> (known after apply)
!~      md5hexhash          = "de2ca5ef8719563b23c704ac31504e89" -> (known after apply)
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #39](https://github.com/cal-itp/data-infra/actions/runs/14977467122)